{"CVE-2023-21839":{"Published":"2023-01-18T00:15:00","summary":"Vulnerability in the Oracle WebLogic Server product of Oracle Fusion Middleware (component: Core).  Supported versions that are affected are 12.2.1.3.0, 12.2.1.4.0 and  14.1.1.0.0. Easily exploitable vulnerability allows unauthenticated attacker with network access via T3, IIOP to compromise Oracle WebLogic Server.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all Oracle WebLogic Server accessible data. CVSS 3.1 Base Score 7.5 (Confidentiality impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N)."},"CVE-2023-22809":{"Published":"2023-01-18T17:15:00","summary":"In Sudo before 1.9.12p2, the sudoedit (aka -e) feature mishandles extra arguments passed in the user-provided environment variables (SUDO_EDITOR, VISUAL, and EDITOR), allowing a local attacker to append arbitrary entries to the list of files to process. This can lead to privilege escalation. Affected versions are 1.8.0 through 1.9.12.p1. The problem exists because a user-specified editor may contain a \"--\" argument that defeats a protection mechanism, e.g., an EDITOR='vim -- /path/to/extra/file' value."},"CVE-2023-22960":{"Published":"2023-01-23T21:15:00","summary":"Lexmark products through 2023-01-10 have Improper Control of Interaction Frequency."},"CVE-2023-23126":{"Published":"2023-02-01T14:15:00","summary":"Connectwise Automate 2022.11 is vulnerable to Clickjacking. The login screen can be iframed and used to manipulate users to perform unintended actions."},"CVE-2023-23127":{"Published":"2023-02-01T14:15:00","summary":"In Connectwise Control 22.8.10013.8329, the login page does not implement HSTS headers therefore not enforcing HTTPS."},"CVE-2023-23128":{"Published":"2023-02-01T14:15:00","summary":"Connectwise Control 22.8.10013.8329 is vulnerable to Cross Origin Resource Sharing (CORS)."},"CVE-2023-23130":{"Published":"2023-02-01T14:15:00","summary":"Connectwise Automate 2022.11 is vulnerable to Cleartext authentication. Authentication is being done via HTTP (cleartext) with SSL disabled."},"CVE-2023-23131":{"Published":"2023-02-01T14:15:00","summary":"Selfwealth iOS mobile App 3.3.1 is vulnerable to Insecure App Transport Security (ATS) Settings."},"CVE-2023-23132":{"Published":"2023-02-01T14:15:00","summary":"Selfwealth iOS mobile App 3.3.1 is vulnerable to Sensitive key disclosure. The application reveals hardcoded API keys."},"CVE-2023-23488":{"Published":"2023-01-20T18:15:00","summary":"The Paid Memberships Pro WordPress Plugin, version \u003c 2.9.8, is affected by an unauthenticated SQL injection vulnerability in the 'code' parameter of the '/pmpro/v1/order' REST route."},"CVE-2023-23924":{"Published":"2023-02-01T00:15:00","summary":"Dompdf is an HTML to PDF converter. The URI validation on dompdf 2.0.1 can be bypassed on SVG parsing by passing `\u003cimage\u003e` tags with uppercase letters. This may lead to arbitrary object unserialize on PHP \u003c 8, through the `phar` URL wrapper. An attacker can exploit the vulnerability to call arbitrary URL with arbitrary protocols, if they can provide a SVG file to dompdf. In PHP versions before 8.0.0, it leads to arbitrary unserialize, that will lead to the very least to an arbitrary file deletion and even remote code execution, depending on classes that are available."},"CVE-2023-24055":{"Published":"2023-01-22T04:15:00","summary":"** DISPUTED ** KeePass through 2.53 (in a default installation) allows an attacker, who has write access to the XML configuration file, to obtain the cleartext passwords by adding an export trigger. NOTE: the vendor's position is that the password database is not intended to be secure against an attacker who has that level of access to the local PC."},"CVE-2023-24610":{"Published":"2023-02-01T14:15:00","summary":"NOSH 4a5cfdb allows remote authenticated users to execute PHP arbitrary code via the \"practice logo\" upload feature. The client-side checks can be bypassed. This may allow attackers to steal Protected Health Information because the product is for health charting."}}