{"CVE-2000-0008":{"Published":"1999-12-26T05:00:00","summary":"FTPPro allows local users to read sensitive information, which is stored in plain text."},"CVE-2000-0010":{"Published":"1999-12-26T05:00:00","summary":"WebWho+ whois.cgi program allows remote attackers to execute commands via shell metacharacters in the TLD parameter."},"CVE-2000-0017":{"Published":"1999-12-21T05:00:00","summary":"Buffer overflow in Linux linuxconf package allows remote attackers to gain root privileges via a long parameter."},"CVE-2000-0019":{"Published":"1999-03-04T05:00:00","summary":"IMail POP3 daemon uses weak encryption, which allows local users to read files."},"CVE-2000-0020":{"Published":"1999-12-20T05:00:00","summary":"DNS PRO allows remote attackers to conduct a denial of service via a large number of connections."},"CVE-2000-0028":{"Published":"1999-12-23T05:00:00","summary":"Internet Explorer 5.0 and 5.01 allows remote attackers to bypass the cross frame security policy and read files via the external.NavigateAndFind function."},"CVE-2000-0031":{"Published":"2000-10-20T04:00:00","summary":"The initscripts package in Red Hat Linux allows local users to gain privileges via a symlink attack."},"CVE-2000-0034":{"Published":"1999-12-22T05:00:00","summary":"Netscape 4.7 records user passwords in the preferences.js file during an IMAP or POP session, even if the user has not enabled \"remember passwords.\""},"CVE-2000-0038":{"Published":"1999-12-23T05:00:00","summary":"glFtpD includes a default glftpd user account with a default password and a UID of 0."},"CVE-2000-0040":{"Published":"1999-12-23T05:00:00","summary":"glFtpD allows local users to gain privileges via metacharacters in the SITE ZIPCHK command."},"CVE-2000-0047":{"Published":"1999-10-01T04:00:00","summary":"Buffer overflow in Yahoo Pager/Messenger client allows remote attackers to cause a denial of service via a long URL within a message."},"CVE-2000-0065":{"Published":"2000-01-17T05:00:00","summary":"Buffer overflow in InetServ 3.0 allows remote attackers to execute commands via a long GET request."},"CVE-2000-0066":{"Published":"2000-01-13T05:00:00","summary":"WebSite Pro allows remote attackers to determine the real pathname of webdirectories via a malformed URL request."},"CVE-2000-0067":{"Published":"2000-01-11T05:00:00","summary":"CyberCash Merchant Connection Kit (MCK) allows local users to modify files via a symlink attack."},"CVE-2000-0069":{"Published":"2000-01-01T05:00:00","summary":"The recover program in Solstice Backup allows local users to restore sensitive files."},"CVE-2000-0074":{"Published":"2000-01-11T05:00:00","summary":"PowerScripts PlusMail CGI program allows remote attackers to execute commands via a password file with improper permissions."},"CVE-2000-0081":{"Published":"2000-01-10T05:00:00","summary":"Hotmail does not properly filter JavaScript code from a user's mailbox, which allows a remote attacker to execute the code by using hexadecimal codes to specify the javascript: protocol, e.g. j\u0026#x41;vascript."},"CVE-2000-0084":{"Published":"2000-01-06T05:00:00","summary":"CuteFTP uses weak encryption to store password information in its tree.dat file."},"CVE-2000-0085":{"Published":"2000-01-04T05:00:00","summary":"Hotmail does not properly filter JavaScript code from a user's mailbox, which allows a remote attacker to execute code via the LOWSRC or DYNRC parameters in the IMG tag."},"CVE-2000-0093":{"Published":"2000-01-21T05:00:00","summary":"An installation of Red Hat uses DES password encryption with crypt() for the initial password, instead of md5."},"CVE-2000-0101":{"Published":"2000-02-01T05:00:00","summary":"The Make-a-Store OrderPage shopping cart application allows remote users to modify sensitive purchase information via hidden form fields."},"CVE-2000-0102":{"Published":"2000-02-01T05:00:00","summary":"The SalesCart shopping cart application allows remote users to modify sensitive purchase information via hidden form fields."},"CVE-2000-0103":{"Published":"2000-02-01T05:00:00","summary":"The SmartCart shopping cart application allows remote users to modify sensitive purchase information via hidden form fields."},"CVE-2000-0104":{"Published":"2000-02-01T05:00:00","summary":"The Shoptron shopping cart application allows remote users to modify sensitive purchase information via hidden form fields."},"CVE-2000-0106":{"Published":"2000-02-01T05:00:00","summary":"The EasyCart shopping cart application allows remote users to modify sensitive purchase information via hidden form fields."},"CVE-2000-0108":{"Published":"2000-02-01T05:00:00","summary":"The Intellivend shopping cart application allows remote users to modify sensitive purchase information via hidden form fields."},"CVE-2000-0109":{"Published":"2000-01-31T05:00:00","summary":"The mcsp Client Site Processor system (MultiCSP) in Standard and Poor's ComStock is installed with several accounts that have no passwords or easily guessable default passwords."},"CVE-2000-0110":{"Published":"2000-02-01T05:00:00","summary":"The WebSiteTool shopping cart application allows remote users to modify sensitive purchase information via hidden form fields."},"CVE-2000-0114":{"Published":"2000-02-02T05:00:00","summary":"Frontpage Server Extensions allows remote attackers to determine the name of the anonymous account via an RPC POST request to shtml.dll in the /_vti_bin/ virtual directory."},"CVE-2000-0115":{"Published":"2000-01-21T05:00:00","summary":"IIS allows local users to cause a denial of service via invalid regular expressions in a Visual Basic script in an ASP page."},"CVE-2000-0123":{"Published":"2000-02-01T05:00:00","summary":"The shopping cart application provided with Filemaker allows remote users to modify sensitive purchase information via hidden form fields."},"CVE-2000-0126":{"Published":"2000-01-26T05:00:00","summary":"Sample Internet Data Query (IDQ) scripts in IIS 3 and 4 allow remote attackers to read files via a .. (dot dot) attack."},"CVE-2000-0129":{"Published":"2000-02-04T05:00:00","summary":"Buffer overflow in the SHGetPathFromIDList function of the Serv-U FTP server allows attackers to cause a denial of service by performing a LIST command on a malformed .lnk file."},"CVE-2000-0134":{"Published":"2000-02-01T05:00:00","summary":"The Check It Out shopping cart application allows remote users to modify sensitive purchase information via hidden form fields."},"CVE-2000-0135":{"Published":"2000-02-01T05:00:00","summary":"The @Retail shopping cart application allows remote users to modify sensitive purchase information via hidden form fields."},"CVE-2000-0136":{"Published":"2000-02-01T05:00:00","summary":"The Cart32 shopping cart application allows remote users to modify sensitive purchase information via hidden form fields."},"CVE-2000-0137":{"Published":"2000-02-01T05:00:00","summary":"The CartIt shopping cart application allows remote users to modify sensitive purchase information via hidden form fields."},"CVE-2000-0142":{"Published":"2000-02-11T05:00:00","summary":"The authentication protocol in Timbuktu Pro 2.0b650 allows remote attackers to cause a denial of service via connections to port 407 and 1417."},"CVE-2000-0143":{"Published":"2000-02-11T05:00:00","summary":"The SSH protocol server sshd allows local users without shell access to redirect a TCP connection through a service that uses the standard system password database for authentication, such as POP or FTP."},"CVE-2000-0145":{"Published":"2000-02-05T05:00:00","summary":"The libguile.so library file used by gnucash in Debian GNU/Linux is installed with world-writable permissions."},"CVE-2000-0182":{"Published":"2000-02-23T05:00:00","summary":"iPlanet Web Server 4.1 allows remote attackers to cause a denial of service via a large number of GET commands, which consumes memory and causes a kernel panic."},"CVE-2000-0220":{"Published":"2000-02-24T05:00:00","summary":"ZoneAlarm sends sensitive system and network information in cleartext to the Zone Labs server if a user requests more information about an event."},"CVE-2000-0649":{"Published":"2000-07-13T04:00:00","summary":"IIS 4.0 allows remote attackers to obtain the internal IP address of the server via an HTTP 1.0 request for a web page which is protected by basic authentication and has no realm defined."}}